# F24-W4111-03: Introduction to Databases: Homework 1, Part B

## Submission Instructions

__Note to TAs:__ Please complete this information, create GradeScope entries, etc.

## Environment Setup

This section tests your environment for HW1B.

If you successfuly completed HW0, you should not have any problems.

Please make sure you set your MySQL user id and password correctly.

In [1]:
# %pip install pandas
import pandas

In [2]:
import sqlalchemy

In [3]:
import pymysql

In [4]:
import json

In [5]:
%load_ext sql

In [6]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [7]:
engine = sqlalchemy.create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

## Entity Relationship Modeling

### Top-Down Modeling

The ability to prduce an ER diagram from a "human" description of the data model is an import skill. In this process, you may have to make and document assumptions or explain decisions. There is no single, correct answer. As long as your assumptions and decisions are reasonable, and your model accurately reflects requirements and decisions, your model answer is "correct."

In this scenario, there are four entity types/entity sets:
1. ```Person(id, last_name, first_name, middle_name, created_timestamp, last_modified_timestamp)```: Basic information about a person. The type has properties/attributes:
   - ```id``` uniquely indentifies the ```Person```
   - ```last_name```
   - ```first_name```
   - ```middle_name```
   - ```created_timestamp```: When the the entity was created for the first time.
   - ```last_modified_timestamp```: The last time the entity's information changed.
2. ```Contact_Information(contact_type, contact_value)```: Represents a mechanism for contacting a person.
   - ```id```: A unique ID for the ```Contact_Information```.
   - ```contact_type```: Indicates the type of contact, e.g. "primary phone," "email," etc.
   - ```contact_value:``` The value for the contact. This is simply a text string for both types of contact. For example, "bilbo.baggins@shire.org" or "+1 212-555-1212."
4. ```Order(id, product_name, order_date, description)```: Represents someone having placed an order to purchase something. Order has the properties:
   - ```id```: Uniquely identifies the ```Order```
   - ```product_name```: The name of the product, e.g. "Strawbery Poptarts," "Cross Pen."
   - ```order_date```: The date the order was placed
   - ```description```: A text description of the order
6. ```Comment(id, comment, comment_timestamp)```: Represent a user's comment on an order. Comment has three properties:
   - ```id```: Uniquely identifies the ```Comment```
   - ```comment```: Text of the comment
   - ```comment_timestamp```: Timestamp when the comment was made.

The model has the following relationships/entity sets:
- ```Person-Comment``` is a relationship the represents the fact that the ```Person``` made the ```Comment```. A ```Person``` may make many ```Comments```, but a ```Comment``` is made by exactly one user.
- ```Order-Comment``` associates the ```Comment``` with the ```Order.``` There may be many ```Comments``` on an ```Order``` but a ```Comment``` has one ```Order.```
- ```Person-Contact-Info``` is between ```Person``` and ```Contact-Info.``` A ```Person``` may have multiple ```Contact-Info``` entries. A ```Contact-Info```  relates to exactly one ```Person```.

The model must represent the fact that ```Contact-Info``` is valid between a start timestamp and end timestamp.

The system never deletes any information.

You must create a Crow's Foot Notation _logical model_ that is your model that satisfies the requirements. You may have to add unspecified attributes to entity types. You can add comments and notes.

Show your diagram below. You can add notes to your diagram or add explanatory text. You can take a screenshot of your diagram and include below. The "Implement ER Diagram" question has an example of embedding an image in the notebook.

There is no single correct answer.

Digram:
<hr><br><br><br>


<hr>

### Implement ER Diagram

<img src='er-to-sql.jpg'>

Write SQL DDL that creates the tables and relationships in the preceding diagram

You can pick ```VARCHAR(32)``` for the type of each column.

You must specify keys and foreign keys.

Create a new database that you name ```hw1b_<uni>``` and replace ```<uni>``` with your UNI. For example, mine would be ```hw1b_dff9.```


You must enter and successfully execute your SQL in the code cell below.

In [ ]:
%%sql

/* Your create and alter table statements. */

## Relational Algebra

You will use the Relax calulator and the schema associated with the text book for this question.

https://dbis-uibk.github.io/relax/calc/gist/4f7866c17624ca9dfa85ed2482078be8/relax-silberschatz-english.txt/0

### Problem 1

Write a relational algebra expression that produces a result table with the following format:

```(student_id, student_name, course_title, course_id, sec_id, semester, year, instructor_id, instructor_name)```

- ```student_id``` is a student's ID (```student.ID```)
- ```student_name``` is a student's name (```student.name```)
- ```course_title``` (```course.title```)
- The following columns are common to ```section, takes, teaches:```
    - ```course_id```
    - ```sec_id```
    - ```semester```
    - ```year```
- ```instructor_id``` is an instructor's ID (```instructor.ID```)
- ```instructor_name``` is an instructor's name (```instructor.name```)

This derived relation represents student that took a section and the instructor taught the section. 

Cut and paste your query in the markdown cell below.

Past relational algebra here.  The following is an example of pasting a relational algebra expression. Replace the following with your expression.

```
/*
This query produces students and their advisors.
*/
(student ⨝ ID=s_id advisor) ⨝ i_id=instructor.ID instructor
```

Execute your query on the Relax calculator and show an image of the first page of your result below. The following shows an example of the format of the answer applied to the above example.

<hr>
<img src="relational1.jpg" width=900px">

<hr>

### Problem 2

Write a relational algebra expression that produces a result table with the following format:

```(dept_name, building, classroom, capacity)```

This contains tuples where:
- The department is in the building, e.g. there is a tuple in ```department``` that has the ```dept_name``` and ```building```.
- The ```classroom``` is in the ```building```.
- The result ONLY contains entries for which the department's ```budget``` is greather than 100,000 or the classroom's ```capacity``` is greater than 100.

Past relational algebra here.

<hr>
Execute your query on the Relax calculator and show an image of the first page of your result below.
<hr>

## SQL

Use the database that is associated with the recommended textbook for these questions. You loaded this in HW0.

### Problem 1

Write a SQL query that produces a table of the form ```(student_id, student_name, advisor_id, advisor_name)``` that shows the ID and name of a student combined with their advisor.  Only include rows where both the student and the advisor are in the ```Comp. Sci.``` and the student has at least 50 total credits.

Execute your SQL below.

In [ ]:
%%sql

### Problem 2

Consider the following query.

In [19]:
%%sql
select * from db_book.student where dept_name='Comp. Sci.'

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58'))]

The following table makes a copy of the student table.

In [20]:
%sql create table student_hw1b as select * from student

 * mysql+pymysql://root:***@localhost
13 rows affected.

[]

In [21]:
%sql select * from student_hw1b where dept_name='Comp. Sci.'

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58'))]

We are now going to make some changes to ```student_hw1b```

Write and execute a SQL statement that changes Willliams tot_cred to 75.

In [22]:
%sql

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

Show the result.

In [23]:
%sql select * from student_hw1b where dept_name='Comp. Sci.'

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('75')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58'))]

Write a SQL statement that deletes Williams from the ```student_hw1b``` table and execute in the cell below.

In [24]:
%%sql

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

Show the resulting table.

In [25]:
%sql select * from student_hw1b where dept_name='Comp. Sci.'

 * mysql+pymysql://root:***@localhost
3 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58'))]

Write and execute SQL statement that puts the original data for Williams back in the table.

In [26]:
%sql

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

Show the table.

In [27]:
%sql select * from student_hw1b where dept_name='Comp. Sci.'

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54'))]